#!/usr/bin/env bash

###################################################################################################
#   本脚本只作为演示本地环境如何完成 ATPG 全流程，用于方便大家理解整个系统工作原理，不作为竞赛输入。
###################################################################################################


###################################################################################################
#   获得本脚本所在的目录
SELFDIR=$(cd $(dirname "$BASH_SOURCE");pwd)


###################################################################################################
#   $1  team        团队名称
#   $2  rankdir     测试用例所在的目录（网表）
#   $3  rankname    测试名称(不含bench后缀)
function main()
{
    local team="$1"
    local rankdir="$2"
    local rankname="$3"

    local   benchfile="${rankdir}/${rankname}.bench"
    cat     "${rankdir}/${rankname}.fault"                                  | \
    "${SELFDIR}/atalanta" --exec atpg           --netlist "${benchfile}"    | \
    "${SELFDIR}/atalanta" --exec simulate-cube  --netlist "${benchfile}"    >   "${rankdir}/${rankname}.pattern"
    return  $?
}


###################################################################################################
main    "$@"
exit    "$?"

